# 4️⃣ Напишіть скрипт, який за введеним користувачем числом від 1 до 12, 
# буде виводити на екран повідомлення у вигляді назви місяця і пори року.
# Якщо користувач введе неприпустиме число, 
# програма має видавати повідомлення про помилку 

months = ["Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень", "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень"]
seasons = ["Зима", "Весна", "Літо", "Осінь"]
user_input = int(input("Введіть число від 1 до 12: "))
    
if 1 <= user_input <= 12:
        month_name = months[user_input - 1]
        season_index = (user_input - 12) // 3
        season_name = seasons[season_index] 
        print(f"{month_name}, {season_name}")
else:
        print("Помилка")